InformationRegisters/КодыОКПД2ИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КодыОКПД2ИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыТНВЭДИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КодыТНВЭДИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеТНВЭДиОКПД2ИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеТНВЭДиОКПД2ИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНВЭДПоВидамПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОКПД2ПоВидамПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыКлассификаторовВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКлассификаторовВидовПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТНВЭДПоВидамПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТНВЭДПоВидамПродукцииИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодЧЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КодыОКПД2ИСМП/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	Элементы.КлассификаторВыбрать.КнопкаПоУмолчанию = Не Параметры.РежимВыбора;
	Если Параметры.РежимВыбора Тогда
		Элементы.КлассификаторВыбрать.Заголовок = НСтр("ru = 'Выбрать'");
	Иначе
		Элементы.КлассификаторВыбрать.Заголовок = НСтр("ru = 'Загрузить'");
	КонецЕсли;
	
	ТНВЭД = Параметры.ТНВЭД;
	Элементы.ТНВЭД.Видимость = ЗначениеЗаполнено(ТНВЭД);
	
	ТекстЗапроса = "";
	ИнтеграцияИС.ОпределитьТекстЗапросаСопоставлениеКодовОКПД2(ТекстЗапроса);
	Если ТекстЗапроса <> "" Тогда
		Список.ТекстЗапроса = ТекстЗапроса;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТНВЭД) Тогда
		ДоработатьТекстЗапроса();
	КонецЕсли;
	
	УстановитьОтборПоТНВЭД(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Параметры.ВидПродукцииТоварнаяГруппа) Тогда
		
		ВидыПродукцииИзПараметра = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(Параметры.ВидПродукцииТоварнаяГруппа);
		Если ТипЗнч(ВидыПродукцииИзПараметра) = Тип("Массив") Тогда
			ВходящиеВидыПродукции = ВидыПродукцииИзПараметра;
		Иначе
			ВходящиеВидыПродукции = Новый Массив;
			ВходящиеВидыПродукции.Добавить(ВидыПродукцииИзПараметра);
		КонецЕсли;
		
		ВидыПродукции.ЗагрузитьЗначения(ВходящиеВидыПродукции);
		ВидыПродукцииОтбора = Новый ФиксированныйМассив(ВходящиеВидыПродукции);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ВидПродукции", ВидыПродукцииОтбора,,, Истина);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Классификатор, "ВидПродукции", ВидыПродукцииОтбора,,, Истина);
		
		Элементы.СписокВидПродукции.Видимость        = Ложь;
		Элементы.КлассификаторВидПродукции.Видимость = Ложь;
		
	КонецЕсли;
	
	ВозвращатьСсылкуНаЭлементКлассификатора = Параметры.ВозвращатьСсылкуНаЭлементКлассификатора;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТНВЭДНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ВидПродукцииТоварнаяГруппа",              ВидыПродукции);
	ПараметрыФормы.Вставить("РежимВыбора",                             Истина);
	ПараметрыФормы.Вставить("ВозвращатьСсылкуНаЭлементКлассификатора", Ложь);
	
	ОткрытьФорму("РегистрСведений.КодыТНВЭДИСМП.Форма.ФормаСписка",
		ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТНВЭДОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ТНВЭД = ТНВЭДПоВидуПродукцииИС(ВыбранноеЗначение, ВидыПродукции.ВыгрузитьЗначения());
		УстановитьОтборПоТНВЭД(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТНВЭДПриИзменении(Элемент)
	
	УстановитьОтборПоТНВЭД(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработкаВыбораЗначенияСписка(Элемент.ТекущаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбораЗначенияСписка(ВыбраннаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКлассификатор

&НаКлиенте
Процедура КлассификаторВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ОбработкаВыбораЗначенияКлассификатораИзСписка(Элемент.ТекущаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработкаВыбораЗначенияКлассификатораИзСписка(ВыбраннаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ДоработатьТекстЗапроса()
	
	Список.ТекстЗапроса = СтрШаблон(
	"ВЫБРАТЬ
	|	КодыОКПД2ИСМП.КодОКПД2 КАК КодОКПД2,
	|	КодыОКПД2ИСМП.ВидПродукции КАК ВидПродукции,
	|	КодыОКПД2ИСМП.НаименованиеПолное Как НаименованиеПолное,
	|	КодыОКПД2ИСМП.КодОКПД2Ссылка Как КодОКПД2Ссылка,
	|	КодыОКПД2ИСМП.Сопоставлено КАК Сопоставлено
	|ИЗ
	|	(%1) КАК КодыОКПД2ИСМП
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТНВЭДиОКПД2ИС КАК СоответствиеТНВЭДиОКПД2
	|	ПО ВЫБОР
	|			КОГДА &ТНВЭД = ЗНАЧЕНИЕ(Справочник.ТНВЭДПоВидамПродукцииИС.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|			ИНАЧЕ КодыОКПД2ИСМП.КодОКПД2 = СоответствиеТНВЭДиОКПД2.ОКПД2.Код
	|				И КодыОКПД2ИСМП.ВидПродукции = СоответствиеТНВЭДиОКПД2.ОКПД2.ВидПродукции
	|				И СоответствиеТНВЭДиОКПД2.ТНВЭД = &ТНВЭД
	|		КОНЕЦ
	|ГДЕ
	|	&ТНВЭД = ЗНАЧЕНИЕ(Справочник.ТНВЭДПоВидамПродукцииИС.ПустаяСсылка)
	|	ИЛИ СоответствиеТНВЭДиОКПД2.ТНВЭД = &ТНВЭД",
	Список.ТекстЗапроса);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоТНВЭД(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.Список, "ТНВЭД", Форма.ТНВЭД, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Форма.Классификатор, "ТНВЭД", Форма.ТНВЭД, Истина)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТНВЭДПоВидуПродукцииИС(ТНВЭДСтрокой, ВидПродукции)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", ТНВЭДСтрокой);
	Запрос.УстановитьПараметр("ВидПродукции", ВидПродукции);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ТНВЭДПоВидамПродукцииИС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТНВЭДПоВидамПродукцииИС КАК ТНВЭДПоВидамПродукцииИС
	|ГДЕ
	|	ТНВЭДПоВидамПродукцииИС.Код = &Код
	|	И ТНВЭДПоВидамПродукцииИС.ВидПродукции В (&ВидПродукции)
	|	И ТНВЭДПоВидамПродукцииИС.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКлассификаторовВидовПродукцииИС.Архивный)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораЗначенияСписка(ВыбраннаяСтрока, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Список.РежимВыбора Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
		
		Если ВозвращатьСсылкуНаЭлементКлассификатора Тогда
			Результат = ОбработкаВыбораЗначенияИзСпискаНаСервере(
				ДанныеСтроки.КодОКПД2,
				ДанныеСтроки.НаименованиеПолное,
				ДанныеСтроки.ВидПродукции,
				Ложь);
			ВыбранноеЗначение = Результат.ЭлементСправочника;
		Иначе
			ВыбранноеЗначение = ДанныеСтроки.КодОКПД2;
		КонецЕсли;
		
		ОповеститьОВыборе(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗначенияКлассификатораИзСписка(ВыбраннаяСтрока, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеСтроки = Элементы.Классификатор.ДанныеСтроки(ВыбраннаяСтрока);
	
	Результат = ОбработкаВыбораЗначенияИзСпискаНаСервере(
		ДанныеСтроки.Код,
		ДанныеСтроки.НаименованиеПолное,
		ДанныеСтроки.ВидПродукции,
		ДанныеСтроки.Загружен = 0);
	
	Если ВозвращатьСсылкуНаЭлементКлассификатора Тогда
		ВыбранноеЗначение = Результат.ЭлементСправочника;
	Иначе
		ВыбранноеЗначение = ДанныеСтроки.Код;
	КонецЕсли;
	
	Если Элементы.Список.РежимВыбора Тогда
		ОповеститьОВыборе(ВыбранноеЗначение);
	ИначеЕсли ДанныеСтроки.Загружен = 0 Тогда
		Элементы.Список.Обновить();
		Элементы.Классификатор.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбработкаВыбораЗначенияИзСпискаНаСервере(КодОКПД2, Наименование, ВидПродукции, Записывать)
	
	Результат = ИнтеграцияИСМП.ПолучитьДанныеСопоставленногоКлассификатораОКПД2(КодОКПД2, Наименование);
	
	Если Записывать Тогда
		
		Если ЗначениеЗаполнено(Результат.НаименованиеПолное) Тогда
			НаименованиеПолное = Результат.НаименованиеПолное;
		Иначе
			НаименованиеПолное = Наименование;
		КонецЕсли;
		
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("КодОКПД2", КодОКПД2);
		СтруктураЗаписи.Вставить("ВидПродукции", ВидПродукции);
		СтруктураЗаписи.Вставить("НаименованиеПолное", НаименованиеПолное);
		
		РегистрыСведений.КодыОКПД2ИСМП.ЗаписатьДанныеКода(СтруктураЗаписи);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
